src/СРМ/src/Documents/ЗаключениеДоговора/ЗаключениеДоговора.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаключениеДоговора</name>
  <registerRecords>InformationRegister.ДанныеДоговора</registerRecords>
  <attributes>
    <name>Адрес</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Вид</name>
    <type>
      <types>CatalogRef.ВидыДоговоров</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаКонца</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерДоговора</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Периодичность</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыДоговоров</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипДоговора</name>
    <type>
      <types>EnumRef.ТипыДоговоров</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Редактор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Тариф</name>
    <type>
      <types>CatalogRef.ТарифыДоговоров</types>
    </type>
  </attributes>
</mdclass:Document>

src/СРМ/src/Enums/ТипыДоговоров/ТипыДоговоров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыДоговоров</name>
  <enumValues>
    <name>Аренда</name>
  </enumValues>
  <enumValues>
    <name>Реализация</name>
  </enumValues>
  <enumValues>
    <name>БезвозмездноеПользование</name>
  </enumValues>
</mdclass:Enum>

src/СРМ/src/Documents/ЗаключениеДоговора/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура РассчитатьСуммуДоговора() 
	//Сумма=Аренда.РассчитатьГодовуюСуммуПоДоговору(КонецДня(Объект.Дата),,Объект);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	РассчитатьСуммуДоговора();
КонецПроцедуры

&НаКлиенте
Процедура СтавкаПриИзменении(Элемент)
	РассчитатьСуммуДоговора();
КонецПроцедуры

&НАСервере
Процедура УстановитьДатуОкончанияДоговораРЕализации() 
	Если Объект.ТипДоговора=Перечисления.ТипыДоговоров.Аренда Тогда
		Возврат;
	КонецЕсли;
	
	Объект.ДатаКонца=ДобавитьМесяц(Объект.ДатаНачала,60)-1;
КонецПроцедуры 

&НаКлиенте
Процедура ДатаНачалаПриИзменении(Элемент)
	УстановитьДатуОкончанияДоговораРЕализации();
КонецПроцедуры

&НаКлиенте
Процедура АдресПриИзменении(Элемент)
	Текст = Элемент.ТекстРедактирования;
	Если ПустаяСтрока(Текст) Тогда
		Объект.Адрес = "";
		Возврат;
	КонецЕсли;
		
	// Формируем внутренние значения полей по тексту и параметрам формирования из
	// реквизита ВидКонтактнойИнформацииАдресаДоставки
	Объект.Адрес = Текст;
КонецПроцедуры


&НаКлиенте
Процедура АдресОчистка(Элемент, СтандартнаяОбработка)
	Объект.Адрес = "";
КонецПроцедуры


&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("ПослеЗаписиДоговораОбновитьСписок", ПараметрыЗаписи, Объект.Ссылка); 
КонецПроцедуры


&НаКлиенте
Процедура ТипДоговораПриИзменении(Элемент)
	РассчитатьСуммуДоговора();
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьСуммуИтого(ДанныеСтроки)
	
	ДанныеСтроки.СуммаВсего = ДанныеСтроки.СуммаОсновнойДолг + ДанныеСтроки.СуммаПроценты;
	
КонецПроцедуры
